import re

TITLES = [
    "表紙",
    "第一部 ファンド情報",
    "第１ ファンドの状況",
    "１ 投資法人の概況",
    "(1) 主要な経営指標等の推移",
    "(2) 投資法人の目的及び基本的性格",
    "(3) 投資法人の仕組み",
    "(4) 投資法人の機構",
    "(5) 投資法人の出資総額",
    "(6) 主要な投資主の状況",
    "(7) 資産運用会社従業員等投資口所有制度の内容",
    "２ 投資方針",
    "(1) 投資方針",
    "(2) 投資対象",
    "(3) 分配方針",
    "(4) 投資制限",
    "３ 投資リスク",
    "４ 手数料等及び税金",
    "(1) 申込手数料",
    "(2) 買戻し手数料",
    "(3) 管理報酬等",
    "(4) その他の手数料等",
    "(5) 課税上の取扱い",
    "５ 運用状況",
    "(1) 投資状況",
    "(2) 投資資産",
    "① 投資有価証券の主要銘柄",
    "② 投資不動産物件",
    "③ その他投資資産の主要なもの",
    "(3) 運用実績",
    "① 純資産等の推移",
    "② 分配の推移",
    "③ 自己資本利益率（収益率）の推移",
    "第二部 投資法人の詳細情報",
    "第１ 投資法人の追加情報",
    "１ 投資法人の沿革",
    "２ 役員の状況",
    "３ その他",
    "第２ 手続等",
    "１ 申込（販売）手続等",
    "２ 買戻し手続等",
    "第３ 管理及び運営",
    "１ 資産管理等の概要",
    "(1) 資産の評価",
    "(2) 保管",
    "(3) 存続期間",
    "(4) 計算期間",
    "(5) その他",
    "２ 利害関係人との取引制限",
    "３ 投資主・投資法人債権者の権利",
    "第４ 関係法人の状況",
    "１ 資産運用会社の概況",
    "(1) 名称、資本金の額及び事業の内容",
    "(2) 運用体制",
    "(3) 大株主の状況",
    "(4) 役員の状況",
    "(5) 事業の内容及び営業の概況",
    "２ その他の関係法人の概況",
    "(1) 名称、資本金の額及び事業の内容",
    "(2) 関係業務の概要",
    "(3) 資本関係",
    "第５ 投資法人の経理状況",
    "１ 財務諸表",
    "(1) 貸借対照表",
    "(2) 損益計算書",
    "(3) 投資主資本等変動計算書",
    "(4) 金銭の分配に係る計算書",
    "(5) キャッシュ・フロー計算書",
    "(6) 注記表",
    "(7) 附属明細表",
    "２ 投資法人の現況",
    "純資産額計算書",
    "第６ 販売及び買戻しの実績",
    "第７ 参考情報",
    "独立監査人"
    #"独立監査人の監査報告書"
]


TITLES_SUB_INDEXES = {
    0:[],
    1:list(range(2,33)),
    2:list(range(3,33)),
    3:list(range(4,4+7)),
    4:[],
    5:[],
    6:[],
    7:[],
    8:[],
    9:[],
    10:[],
    11:list(range(12,12+4)),
    12:[],
    13:[],
    14:[],
    15:[],
    16:[],
    17:list(range(18,18+5)),
    18:[],
    19:[],
    20:[],
    21:[],
    22:[],
    23:list(range(24,33)),
    24:[],
    25:list(range(26,26+3)),
    26:[],
    27:[],
    28:[],
    29:list(range(30,30+3)),
    30:[],
    31:[],
    32:[],
    33:list(range(34,74)),
    34:list(range(35,35+3)),
    35:[],
    36:[],
    37:[],
    38:list(range(38,38+2)),
    39:[],
    40:[],
    41:list(range(38,50)),
    42:list(range(43,43+5)),
    43:[],
    44:[],
    45:[],
    46:[],
    47:[],
    48:[],
    49:[],
    50:list(range(50,61)),
    51:list(range(52,52+5)),
    52:[],
    53:[],
    54:[],
    55:[],
    56:[],
    57:list(range(58,58+3)),
    58:[],
    59:[],
    60:[],
    61:list(range(62,72)),
    62:list(range(63,63+7)),
    63:[],
    64:[],
    65:[],
    66:[],
    67:[],
    68:[],
    69:[],
    70:list(range(71,71+1)),
    71:[],
    72:[],
    73:[],
    74:[]
}

z_digit = ["０", "１", "２", "３", "４","５", "６", "７", "８", "９", "１０"]
m_digit = ["⓪", "①", "②", "③", "④","⑤", "⑥", "⑦", "⑧", "⑨", "⑩"]
h_digit = ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"]

zh_digit = {z:h for z, h in zip(z_digit, h_digit)}
mh_digit = {m:h for m, h in zip(m_digit, h_digit)}

def zh_convert(s):
    for z in z_digit:
        s = s.replace(z, zh_digit[z])
    for m in m_digit:
        s = s.replace(m, mh_digit[m])
    return s


def title_normalize(t):
    #特殊文字
    t = re.sub("&#[\d]+;", "", t)
    t = re.sub("[ -/:-@\[-~\s【】、。．（）]", "", t)
    t = zh_convert(t)
    return t


_titles = [title_normalize(k) for k in TITLES]

def es_title_index(t, c=0):
    t = title_normalize(t)
    indexes = [i for i, x in enumerate(_titles) if x == t]
    return indexes[c]

def get_title_from_index(i):
    return _titles[i]
